Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/wifi-mw-core/lwip-whd-port/cy_lwip.c
    /* Initialize the mutex to protect PRNG well512 state */
    if (cy_prng_mutex_ptr == NULL)
    {
        cy_prng_mutex_ptr = &cy_prng_mutex;
        cy_rtos_init_mutex(cy_prng_mutex_ptr);
    }
    /* Feed the random number obtained from WLAN to WELL512
     * algorithm as initial seed value.
     */
    cy_prng_add_entropy((const void *)wlan_rand, 4);

    /*
     * Free the whd buffer used to get the random number from WLAN.
     */
    whd_buffer_release(whd_iface->whd_driver, response, WHD_NETWORK_RX);
#endif
    /*
     * Setup the information associated with sending packets
     */
#if LWIP_IPV4
    iface->output = etharp_output;
#endif
    iface->linkoutput = wifioutput;
    iface->mtu = WHD_LINK_MTU;
    iface->flags |= (NETIF_FLAG_BROADCAST | NETIF_FLAG_ETHARP | NETIF_FLAG_IGMP) ;
#ifdef LWIP_IPV6_MLD
    iface->flags |= NETIF_FLAG_MLD6;
#endif
    /*
     * Set the interface name for the interface
     */
    iface->name[0] = 'w' ;
    iface->name[1] = 'l' ;

#if LWIP_IPV4 && LWIP_IGMP
    netif_set_igmp_mac_filter(iface, igmp_filter) ;
#endif


#if LWIP_IPV6 == 1
    /*
     * Filter output packets for IPV6 through the ethernet output
     * function for IPV6.
     */
    iface->output_ip6 = ethip6_output ;

    /*
     * Automatically generate a unicast IP address based on
     * neighbor discovery.
     */
    iface->ip6_autoconfig_enabled = 1 ;

    /*
     * Create a link local IPV6 address
     */
    netif_create_ip6_linklocal_address(iface, 1);

    /*
     * Tell the radio that we want to listen to solicited-node multicast
     * packets.  These packets are part of the IPV6 neighbor discovery
     * process.
     */
    macaddr.octet[0] = 0x33 ;
    macaddr.octet[1] = 0x33 ;
    macaddr.octet[2] = 0xff ;
    whd_wifi_register_multicast_address(iface->state, &macaddr) ;

    /*
     * Tell the radio that we want to listen to the multicast address
     * that targets all IPV6 devices.  These packets are part of the IPV6
     * neighbor discovery process.
     */
    memset(&macaddr, 0, sizeof(macaddr)) ;
    macaddr.octet[0] = 0x33 ;
    macaddr.octet[1] = 0x33 ;
    macaddr.octet[5] = 0x01 ;
    whd_wifi_register_multicast_address(iface->state, &macaddr) ;

#if LWIP_IPV6_MLD
    /*
     * Register mld mac filter callback function that will be called by lwIP to add or delete an
     * entry in the IPv6 multicast filter table of the ethernet MAC.
     */
    netif_set_mld_mac_filter(iface, mld_mac_filter);
#endif
#endif
    return 0 ;
}

/*
 * This is the main entry point in this file.  This function takes a WHD radio driver
 * handle, interface type and static IP address, and adds interface to LwIP.
 * note : static IP address is optional for STA interface.
 */
cy_rslt_t cy_lwip_add_interface(cy_lwip_nw_interface_t *iface, ip_static_addr_t *static_ipaddr)
{
#if LWIP_IPV4
    ip4_addr_t ipaddr, netmask, gateway ;
#endif

    if(is_interface_valid(iface) != CY_RSLT_SUCCESS)
    {
        return CY_RSLT_LWIP_BAD_ARG;
    }

    /* static IP addr is mandatory for AP */
    if((iface->role == CY_LWIP_AP_NW_INTERFACE) && (static_ipaddr == NULL))
    {
        wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error static IP addr cannot be NULL for AP interface \n");
        return CY_RSLT_LWIP_BAD_ARG;
    }

    if (is_interface_added(iface->role))
    {
        return CY_RSLT_SUCCESS;
    }

#if LWIP_IPV4
    /* Assign the IP address if static, otherwise, zero the IP address */
    if (static_ipaddr != NULL)
    {
        memcpy(&gateway, &static_ipaddr->gateway, sizeof(gateway));
        memcpy(&ipaddr, &static_ipaddr->addr, sizeof(ipaddr));
        memcpy(&netmask, &static_ipaddr->netmask, sizeof(netmask));
    }
    else
    {
        memset(&gateway, 0, sizeof(gateway));
        memset(&ipaddr, 0, sizeof(ipaddr));
        memset(&netmask, 0, sizeof(netmask));
    }

    /* Add the interface to LwIP and make it the default */
    if(netifapi_netif_add((IP_HANDLE(iface->role)), &ipaddr, &netmask, &gateway, iface->whd_iface, wifiinit, tcpip_input) != CY_RSLT_SUCCESS)
    {
        wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error adding interface \n");
        return CY_RSLT_LWIP_ERROR_ADDING_INTERFACE;
    }
#else
    if(netifapi_netif_add((IP_HANDLE(iface->role)), iface->whd_iface, wifiinit, tcpip_input) != CY_RSLT_SUCCESS)
    {
        wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error adding interface \n");
        return CY_RSLT_LWIP_ERROR_ADDING_INTERFACE;
    }
#endif

    if(iface->role == CY_LWIP_STA_NW_INTERFACE)
    {
        if(static_ipaddr == NULL)
        {
            is_dhcp_client_required = true;
        }
        netifapi_netif_set_default(IP_HANDLE(iface->role)) ;
    }

    /*
     * Register a handler for any address changes
     * Note : The "status" callback will also be called when the interface
     * goes up or down
     */
    netif_set_status_callback((IP_HANDLE(iface->role)), internal_ip_change_callback);
    SET_IP_NETWORK_INITED(iface->role, true);

    return CY_RSLT_SUCCESS ;
}

struct netif* cy_lwip_get_interface(cy_lwip_nw_interface_role_t role)
{
    if((role != CY_LWIP_AP_NW_INTERFACE) && (role != CY_LWIP_STA_NW_INTERFACE))
    {
        return NULL;
    }
    return (IP_HANDLE(role));
}

cy_rslt_t cy_lwip_remove_interface(cy_lwip_nw_interface_t *iface)
{
    if(is_interface_valid(iface) != CY_RSLT_SUCCESS)
    {
        return CY_RSLT_LWIP_BAD_ARG;
    }

    /* Interface can be removed only if the interface was previously added and network is down */
    if(!is_interface_added(iface->role))
    {
        wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error Interface doesn't exist \n");
        return CY_RSLT_LWIP_INTERFACE_DOES_NOT_EXIST;
    }

    if(is_network_up(iface->role))
    {
        wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error removing interface, bring down the network before removing the interface \n");
        return CY_RSLT_LWIP_ERROR_REMOVING_INTERFACE;
    }
    /* remove status callback */
    netif_set_remove_callback(IP_HANDLE(iface->role), internal_ip_change_callback);
    /* remove the interface */
    netifapi_netif_remove(IP_HANDLE(iface->role));
    if(iface->role == CY_LWIP_STA_NW_INTERFACE)
    {
        is_dhcp_client_required = false;
    }

    SET_IP_NETWORK_INITED(iface->role, false);
#ifdef COMPONENT_43907
    /* cy_prng_mutex_ptr is initialized when the first network intefrace is initialized.
     * Deinitialize the mutex only after all the interfaces are deinitiazed.
     */
    if (!ip_networking_inited[CY_LWIP_STA_NW_INTERFACE] &&
        !ip_networking_inited[CY_LWIP_AP_NW_INTERFACE])
    {
        if (cy_prng_mutex_ptr != NULL)
        {
            cy_rtos_deinit_mutex(cy_prng_mutex_ptr);
            cy_prng_mutex_ptr = NULL;
        }
    }
#endif
    return CY_RSLT_SUCCESS;
}

cy_rslt_t cy_lwip_network_up(cy_lwip_nw_interface_t *iface)
{
    cy_rslt_t result                     = CY_RSLT_SUCCESS;
    uint32_t  address_resolution_timeout = 0;
    bool      timeout_occurred           = false;

