Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/wifi-mw-core/lwip-whd-port/cy_lwip.c
#if LWIP_IPV4
    ip4_addr_t ip_addr;
#endif
    if(is_interface_valid(iface) != CY_RSLT_SUCCESS)
    {
        return CY_RSLT_LWIP_BAD_ARG;
    }

    if(is_network_up(iface->role))
    {
        wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Network is already up \n");
        return CY_RSLT_SUCCESS;
    }

    /*
     * If LPA is enabled, invoke activity callback to resume the network stack,
     * before invoking the lwip APIs that requires TCP Core lock.
     */
    if (activity_callback)
    {
        activity_callback(true);
    }

    /*
    * Bring up the network interface.
    */
    netifapi_netif_set_up((IP_HANDLE(iface->role)));

    /*
    * Bring up the network link layer
    */
    netifapi_netif_set_link_up((IP_HANDLE(iface->role)));

#if LWIP_IPV6
    /* Wait for IPV6 address to change from tentative to valid or invalid */
    while(ip6_addr_istentative(netif_ip6_addr_state(IP_HANDLE(iface->role), 0)))
    {
        /* Give LwIP time to change the state */
        cy_rtos_delay_milliseconds(ND6_TMR_INTERVAL);
    }

    /* LWIP changes state to either INVALID or VALID. Check if the state is VALID */
    if(ip6_addr_isvalid(netif_ip6_addr_state(IP_HANDLE(iface->role), 0)))
    {
        wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "IPv6 Network ready IP: %s \r\n", ip6addr_ntoa(netif_ip6_addr(IP_HANDLE(iface->role), 0)));
    }
    else
    {
        wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "IPv6 network not ready \r\n");
    }
#endif

#if LWIP_IPV4
    if(iface->role == CY_LWIP_STA_NW_INTERFACE)
    {
        if(is_dhcp_client_required)
        {
            /* TO DO :  Save the current power save state */
            /* TO DO :  Disable power save for the DHCP exchange */

            /*
             * For DHCP only, we should reset netif IP address
             * We don't want to re-use previous netif IP address
             * given from previous DHCP session
             */
            ip4_addr_set_zero(&ip_addr);

            /*
             * If LPA is enabled, invoke activity callback to resume the network stack,
             * before invoking the lwip APIs that requires TCP Core lock.
             */
            if (activity_callback)
            {
                activity_callback(true);
            }

            netif_set_ipaddr(IP_HANDLE(iface->role), &ip_addr);

            /*
             * If LPA is enabled, invoke activity callback to resume the network stack,
             * before invoking the lwip APIs that requires TCP Core lock.
             */
            if (activity_callback)
            {
                activity_callback(true);
            }

            /* TO DO : DHCPV6 need to be handled when we support IPV6 addresses other than the link local address */
            /* Start DHCP */
            if(netifapi_dhcp_start(IP_HANDLE(iface->role)) != CY_RSLT_SUCCESS)
            {
                return CY_RSLT_LWIP_ERROR_STARTING_DHCP;
            }
            /* Wait a little to allow DHCP a chance to complete */

            while((netif_dhcp_data(IP_HANDLE(iface->role))->state != DHCP_STATE_BOUND) && (timeout_occurred == false))
            {
                cy_rtos_delay_milliseconds(10);
                address_resolution_timeout += 10;
                if(address_resolution_timeout >= DHCP_IP_ADDRESS_RESOLUTION_TIMEOUT_IN_MS)
                {
                    /* timeout has occurred */
                    timeout_occurred = true;
                }
            }

            if (timeout_occurred)
            {
                /*
                 * If LPA is enabled, invoke activity callback to resume the network stack,
                 * before invoking the lwip APIs that requires TCP Core lock.
                 */
                if (activity_callback)
                {
                    activity_callback(true);
                }
                netifapi_dhcp_release_and_stop(IP_HANDLE(iface->role));
#if LWIP_AUTOIP
                int   tries = 0;
                wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "Unable to obtain IP address via DHCP. Perform Auto IP\n");
                address_resolution_timeout = 0;
                timeout_occurred            = false;

                /*
                 * If LPA is enabled, invoke activity callback to resume the network stack,
                 * before invoking the lwip APIs that requires TCP Core lock.
                 */
                if (activity_callback)
                {
                    activity_callback(true);
                }

                if (autoip_start(IP_HANDLE(iface->role) ) != ERR_OK )
                {
                    /* trick: skip the while-loop, do the cleaning up stuff */
                    timeout_occurred = true;
                }

                while ((timeout_occurred == false) && ((netif_autoip_data(IP_HANDLE(iface->role))->state != AUTOIP_STATE_BOUND)))
                {
                    cy_rtos_delay_milliseconds(10);
                    address_resolution_timeout += 10;
                    if(address_resolution_timeout >= AUTO_IP_ADDRESS_RESOLUTION_TIMEOUT_IN_MS)
                    {
                        if(tries++ < MAX_AUTO_IP_RETRIES)
                        {
                            address_resolution_timeout = 0;
                        }
                        else
                        {
                            timeout_occurred = true;
                        }
                     }
                }

                if (timeout_occurred)
                {
                    wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Unable to obtain IP address via DCHP and AutoIP\n");

                    /*
                     * If LPA is enabled, invoke activity callback to resume the network stack,
                     * before invoking the lwip APIs that requires TCP Core lock.
                     */
                    if (activity_callback)
                    {
                        activity_callback(true);
                    }

                    autoip_stop(IP_HANDLE(iface->role));
                    return CY_RSLT_LWIP_DHCP_WAIT_TIMEOUT;
                }
                else
                {
                    wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "IP address obtained through AutoIP \n");
                }
#else
                wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Unable to obtain IP address via DHCP\n");
                return CY_RSLT_LWIP_DHCP_WAIT_TIMEOUT;
#endif
            }
        }
    }
    else
    {
        memset(&internal_dhcp_server, 0, sizeof(internal_dhcp_server));
        igmp_start(IP_HANDLE(iface->role));
        /* Start internal DHCP server */
        if((result = cy_lwip_dhcp_server_start(&internal_dhcp_server, iface->role))!= CY_RSLT_SUCCESS)
        {
            return CY_RSLT_LWIP_ERROR_STARTING_DHCP;
        }
    }
#endif

