Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/wifi-mw-core/lwip-whd-port/cy_lwip.c
    SET_IP_UP(iface->role, true);
    return result;
}

cy_rslt_t cy_lwip_network_down(cy_lwip_nw_interface_t *iface)
{
    if(is_interface_valid(iface) != CY_RSLT_SUCCESS)
    {
        return CY_RSLT_LWIP_BAD_ARG;
    }

    if(!is_network_up(iface->role))
    {
        wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "Network is not UP \r\n");
        return CY_RSLT_LWIP_INTERFACE_NETWORK_NOT_UP;
    }

#if LWIP_IPV4
    if(is_dhcp_client_required)
    {
#if LWIP_AUTOIP
        if(netif_autoip_data(IP_HANDLE(iface->role))->state == AUTOIP_STATE_BOUND)
        {
            /*
             * If LPA is enabled, invoke activity callback to resume the network stack,
             * before invoking the lwip APIs that requires TCP Core lock.
             */
            if (activity_callback)
            {
                activity_callback(true);
            }

            autoip_stop(IP_HANDLE(iface->role));
        }
        else
#endif
        {
            /*
             * If LPA is enabled, invoke activity callback to resume the network stack,
             * before invoking the lwip APIs that requires TCP Core lock.
             */
            if (activity_callback)
            {
                activity_callback(true);
            }

            netifapi_dhcp_release_and_stop(IP_HANDLE(iface->role));
            cy_rtos_delay_milliseconds(DHCP_STOP_DELAY_IN_MS);

            /*
             * If LPA is enabled, invoke activity callback to resume the network stack,
             * before invoking the lwip APIs that requires TCP Core lock.
             */
            if (activity_callback)
            {
                activity_callback(true);
            }

            dhcp_cleanup(IP_HANDLE(iface->role));
        }
    }

    if(iface->role == CY_LWIP_AP_NW_INTERFACE)
    {
        /* Stop internal dhcp server for SoftAP interface */
        cy_lwip_dhcp_server_stop(&internal_dhcp_server);
    }
#endif

    /*
     * If LPA is enabled, invoke activity callback to resume the network stack,
     * before invoking the lwip APIs that requires TCP Core lock.
     */
    if (activity_callback)
    {
        activity_callback(true);
    }

    /*
    * Bring down the network link layer
    */
    netifapi_netif_set_link_down(IP_HANDLE(iface->role));

    /*
    * Bring down the network interface
    */
    netifapi_netif_set_down(IP_HANDLE(iface->role));

    /* TO DO : clear all ARP cache */

    /** TO DO:
     *  Kick the radio chip if it's in power save mode in case the link down event is due to missing beacons.
     *  Setting the chip to the same power save mode is sufficient.
     */
    SET_IP_UP(iface->role, false);
    return CY_RSLT_SUCCESS;
}

void cy_lwip_register_ip_change_cb(cy_lwip_ip_change_callback_t cb)
{
    ip_change_callback = cb;
}

/*
 * This functions helps to register/unregister callback for network activity
 */
void cy_network_activity_register_cb(cy_network_activity_event_callback_t cb)
{
    /* update the activity callback with the argument passed */
    activity_callback = cb;
}

/*
 * This function notifies network activity to LPA module.
 */
cy_rslt_t cy_network_activity_notify(cy_network_activity_type_t activity_type)
{
    if(activity_callback)
    {
        if(activity_type == CY_NETWORK_ACTIVITY_TX)
        {
            activity_callback(true);
        }
        else if(activity_type == CY_NETWORK_ACTIVITY_RX)
        {
            activity_callback(false);
        }
        else
        {
            wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid network activity type\n");
            return CY_RSLT_LWIP_BAD_ARG;
        }
    }

    return CY_RSLT_SUCCESS;
}
#if LWIP_IPV4
cy_rslt_t cy_lwip_dhcp_renew(cy_lwip_nw_interface_t *iface)
{
    if(is_interface_valid(iface) != CY_RSLT_SUCCESS)
    {
        return CY_RSLT_LWIP_BAD_ARG;
    }
    /* Invalidate ARP entries */
    netifapi_netif_common(IP_HANDLE(iface->role), (netifapi_void_fn) invalidate_all_arp_entries, NULL );


    /*
     * If LPA is enabled, invoke activity callback to resume the network stack,
     * before invoking the lwip APIs that requires TCP Core lock.
     */
    if (activity_callback)
    {
        activity_callback(true);
    }

    /* DHCP renewal*/
    netifapi_netif_common(IP_HANDLE(iface->role), (netifapi_void_fn)dhcp_renew, NULL);

    cy_rtos_delay_milliseconds(DCHP_RENEWAL_DELAY_IN_MS);
    return CY_RSLT_SUCCESS;
}

/**
 * Remove all ARP table entries of the specified netif.
 * @param netif points to a network interface
 */
static void invalidate_all_arp_entries(struct netif *netif)
{
     /*free all the entries in arp list */
    etharp_cleanup_netif(netif);
}
#endif

/* Used to register callback for EAPOL packets */
cy_rslt_t cy_wifimwcore_eapol_register_receive_handler( cy_wifimwcore_eapol_packet_handler_t eapol_packet_handler )
{
    internal_eapol_packet_handler = eapol_packet_handler;
    return CY_RSLT_SUCCESS;
}

static void internal_ip_change_callback (struct netif *netif)
{
    /* notify wcm about ip change */
    if(ip_change_callback != NULL)
    {
        ip_change_callback(NULL);
    }
}

static bool is_interface_added(cy_lwip_nw_interface_role_t role)
{
    return (ip_networking_inited[((uint8_t)role)&3]);
}

static bool is_network_up(cy_lwip_nw_interface_role_t role)
{
    return (ip_up[((uint8_t)role)&3]);
}

static cy_rslt_t is_interface_valid(cy_lwip_nw_interface_t *iface)
{
    if((iface == NULL) || ((iface->role != CY_LWIP_AP_NW_INTERFACE) && (iface->role != CY_LWIP_STA_NW_INTERFACE)))
    {
        return CY_RSLT_LWIP_BAD_ARG;
    }

    return CY_RSLT_SUCCESS;
}

#ifdef COMPONENT_43907
/* 43907 kits does not have TRNG module.
 * Following are the functions to generate pseudo randon numbers
 * These functions internal to AnyCloud library, currently used
 * by secure sockets and WCM.
 */
static uint32_t crc32_calc( const uint8_t* buffer, uint16_t buffer_length, uint32_t prev_crc32 )
{
    uint32_t crc32 = ~prev_crc32;
    int i;

    for ( i = 0; i < buffer_length; i++ )
    {
        int j;

